jinyichengX/test/ESDBox_IPGUI/scr_driver/stm32/stm32f4/stm32f429_39xx.c
/*
 * MIT License
 *
 * Copyright (c) 2025 JinYiCheng
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#if !defined(STM32F429xx) && !defined(STM32F439xx)
#include "ipgui_utils.h"
#endif
#include "lcd.h"
#include "ipgui_cm4.h"
#ifndef ipgui_writel
#define ipgui_writel(a, v)                  (*(volatile unsigned int *)(a) = (v))
#endif
#ifndef ipgui_readl
#define ipgui_readl(a)                      (*(volatile unsigned int *)(a))
#endif
#include "stm32f429xx.h"
#include "stm32f4xx.h"
#include "db_stm32f4xx_gpio.h"
/* 这个驱动文件仅仅适配正点原子的阿波罗STM32F429IGT6
 * 适配其他型号的STM32芯片或者板卡需要修改驱动, 需要修改（1）面板参数 （2）像素时钟LCD_CLK （3）LCD引脚
 */
void LTDC_Color_Fill(u16 sx, u16 sy, u16 ex, u16 ey, u16 *color);
void ltdc_layer1_reload_framebuffer_imediately(void * fb);
void dma2d_irq_init(void);
#define LCD_FRAME_BUF_ADDR			0XC0000000  
unsigned short ltdc_lcd_framebuf[LCD_WIDTH * LCD_HEIGHT] __attribute__((at(LCD_FRAME_BUF_ADDR)));	//定义最大屏分辨率时,LCD所需的帧缓存数组大小
unsigned short ltdc_lcd_framebuf1[LCD_WIDTH * LCD_HEIGHT] __attribute__((at(LCD_FRAME_BUF_ADDR + sizeof(unsigned short) * LCD_WIDTH * LCD_HEIGHT)));	//定义最大屏分辨率时,LCD所需的帧缓存数组大小
unsigned short * fore_lcd_framebuffer; //foreground framebuffer
unsigned short * back_lcd_framebuffer; //background framebuffer
char back_state = 0;
char back_render_ready = 0;
char dma_busy = 0;
int x1,y1,x2,y2; 
unsigned short * color;
/* clock */
#define RCC_BASE_ADDR           0x40023800                                  /* RCC memory map base */
#define RCC_AHB1ENR_ADDR        (RCC_BASE_ADDR + 0x30)                      /* RCC AHB1 peripheral clock enable register */
#define RCC_APB2ENR_ADDR        (RCC_BASE_ADDR + 0x44)                      /* RCC APB2 peripheral clock enable register */

/* gpio registers */
#define GPIO_BASE_ADDR          0x40020000                                  /* GPIO memory map base */
#define GPIO_PORT(n)            (GPIO_BASE_ADDR + (0x400 * (n)))
#define GPIOR(n, i)             (GPIO_PORT(n) + 0x4 * (i))

/* ltdc general registers */
#define LTDC_BASE_ADDR          0x40016800                                  /* LTDC memory map base */

#define LTDC_SSCR_ADDR          (LTDC_BASE_ADDR + 0x08)                     /* LTDC Synchronization Size Configuration Register */
#define LTDC_BPCR_ADDR          (LTDC_BASE_ADDR + 0x0c)                     /* LTDC Back Porch Configuration Register */
#define LTDC_AWCR_ADDR          (LTDC_BASE_ADDR + 0x10)                     /* LTDC Active Width Configuration Register */
#define LTDC_TWCR_ADDR          (LTDC_BASE_ADDR + 0x14)                     /* LTDC Total Width Configuration Register */
#define LTDC_GCR_ADDR           (LTDC_BASE_ADDR + 0x18)                     /* LTDC Global Control Register */
#define LTDC_SRCR_ADDR          (LTDC_BASE_ADDR + 0x24)                     /* LTDC Shadow Reload Configuration Register */
#define LTDC_BCCR_ADDR          (LTDC_BASE_ADDR + 0x2c)                     /* LTDC Back Color Configuration Register */

#define LTDC_IER_ADDR           (LTDC_BASE_ADDR + 0x34)                     /* LTDC Interrupt Enable Register(RW) */
#define LTDC_ISR_ADDR           (LTDC_BASE_ADDR + 0x38)                     /* LTDC Interrupt Status Register(RO) */
#define LTDC_ICR_ADDR           (LTDC_BASE_ADDR + 0x3c)                     /* LTDC Interrupt Clear Register(WO) */

/* ldtc layerx registers */
#define LTDC_LCR_ADDR(x)        (LTDC_BASE_ADDR + 0x84 + 0x80 * ((x)-1))    /* LTDC Layerx memory map base */

#define LTDC_LWHPCR_ADDR(x)      (LTDC_LCR_ADDR(x) + 0x04)                  /* LTDC Layerx Window Horizontal Position Configuration Register */
#define LTDC_LWVPCR_ADDR(x)      (LTDC_LCR_ADDR(x) + 0x08)                  /* LTDC Layerx Window Vertical Position Configuration Register */

#define LTDC_LCKCR_ADDR(x)       (LTDC_LCR_ADDR(x) + 0x0c)                  /* LTDC Layerx Color Keying Configuration Register */
#define LTDC_LPFCR_ADDR(x)       (LTDC_LCR_ADDR(x) + 0x10)                  /* LTDC Layerx Pixel Format Configuration Register */
#define LTDC_LCACR_ADDR(x)       (LTDC_LCR_ADDR(x) + 0x14)                  /* LTDC Layerx Constant Alpha Configuration Register */
#define LTDC_LDCCR_ADDR(x)       (LTDC_LCR_ADDR(x) + 0x18)                  /* LTDC Layerx Default Color Configuration Register */
#define LTDC_LBFCR_ADDR(x)       (LTDC_LCR_ADDR(x) + 0x1c)                  /* LTDC Layerx Blending Factors Configuration Register */

#define LTDC_LCFBAR_ADDR(x)      (LTDC_LCR_ADDR(x) + 0x28)                  /* LTDC Layerx Color Frame Buffer Address Register */
#define LTDC_LCFBLR_ADDR(x)      (LTDC_LCR_ADDR(x) + 0x2c)                  /* LTDC Layerx Color Frame Buffer Length Register  */
#define LTDC_LCFBLNR_ADDR(x)     (LTDC_LCR_ADDR(x) + 0x30)                  /* LTDC Layerx Color Frame Buffer Line Number Register */

#define __HAL_RCC_DMA2D_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00; \
                                        SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2DEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2DEN);\
                                        } while(0)

/* 正点原子1024*600 LCD面板参数 */
lcd_panel_param_t lcd_para_default = {
    /* 非可视区（消隐区）参数 */
    .hsw = 4,
    .hbp = 8,
    .hfp = 8,

    .vsh = 4,
    .vbp = 16,
    .vfp = 16,

    /* 可视区参数 */
    .aw = LCD_WIDTH,
    .ah = LCD_HEIGHT,
	
	.bpp = 16	/* bpp改为32的话，LCD控制器会将A值乘到RGB分量上，再送出去，frambuffer需要1024*600*4，如果A设置为0的话那么屏幕什么也不会显示 */
};
 lcd_panel_param_t atk_lcd_para_default = {
    /* 非可视区（消隐区）参数 */
    .hsw = 20,
    .hbp = 140,
    .hfp = 160,

    .vsh = 3,
    .vbp = 20,
    .vfp = 12,

    /* 可视区参数 */
    .aw = LCD_WIDTH,
    .ah = LCD_HEIGHT,
	
	.bpp = 16//16128
};

static void stm32_gpio_ll_init(stm32_gpio_dsc_t * dsc, stm32_gpio_ctl_t * ctl)
{
    int reg;

    /* configure mode register */
    reg =  ipgui_readl(GPIOR(dsc->port, 0));
    reg &= ~(0x03U << (dsc->pin << 1));
    reg |= (ctl->mode << (dsc->pin << 1));
    ipgui_writel(GPIOR(dsc->port, 0), reg);

    /* configure output type register */
    reg = ipgui_readl(GPIOR(dsc->port, 1));
    reg &= ~(1U << dsc->pin);
    reg |= (ctl->otype << dsc->pin);
    ipgui_writel(GPIOR(dsc->port, 1), reg);

