jinyichengX/test/ESDBox_IPGUI/scr_driver/stm32/stm32f4/stm32f429_39xx.c
    /* configure output speed register */
    reg =  ipgui_readl(GPIOR(dsc->port, 2));
    reg &= ~(0x03U << (dsc->pin << 1));
    reg |= (ctl->speed << (dsc->pin << 1));
    ipgui_writel(GPIOR(dsc->port, 2), reg);

    /* configure pull-up/pull-down register */
    reg =  ipgui_readl(GPIOR(dsc->port, 3));
    reg &= ~(0x03U << (dsc->pin << 1));
    reg |= (ctl->pupd << (dsc->pin << 1));
    ipgui_writel(GPIOR(dsc->port, 3), reg);
    
    /* if needed, configure alternate function register */
    if (2 == ctl->mode)
    {
        if (dsc->pin < 8)
        {
            reg =  ipgui_readl(GPIOR(dsc->port, 8));
            reg &= ~(0x0fU << (dsc->pin << 2));
            reg |= (ctl->af << (dsc->pin << 2));
            ipgui_writel(GPIOR(dsc->port, 8), reg);
        } else
        {
            reg =  ipgui_readl(GPIOR(dsc->port, 9));
            reg &= ~(0x0fU << ((dsc->pin - 8) << 2));
            reg |= (ctl->af << ((dsc->pin - 8) << 2));
            ipgui_writel(GPIOR(dsc->port, 9), reg);
        }
    }
}

static void stm32_ltdc_set_bk(unsigned int color)
{
    ipgui_writel(LTDC_BCCR_ADDR, color & 0x00ffffffU);  /* set background color when init */
}

#define SET_PORT_PIN(x, y) dsc.port = x; dsc.pin = y
#define PIN_INIT(n, i)  SET_PORT_PIN(n, i); stm32_gpio_ll_init(&dsc, &ctl)

static void turn_on_lcd_backlight(void)
{
    /* user code begin here */
    int reg;
    stm32_gpio_dsc_t dsc;
    stm32_gpio_ctl_t ctl = {
        .mode = 1, .otype = 0, .pupd = 0, .speed = 3, .af = 0
    };
    reg =  ipgui_readl(RCC_AHB1ENR_ADDR);
    reg |= (1 << 1);
    ipgui_writel(RCC_AHB1ENR_ADDR, reg);

    PIN_INIT(STM32_GPIO_PORT_B, STM32_GPIO_PIN_1);

    reg =  ipgui_readl(GPIOR(dsc.port, 5));             /* read and set odr register */
    reg |= (1 << dsc.pin);
    ipgui_writel(GPIOR(dsc.port, 5), reg);
    /* user code end here */
//	    /* user code begin here */
//    int reg;
//    stm32_gpio_dsc_t dsc;
//    stm32_gpio_ctl_t ctl = {
//        .mode = 1, .otype = 0, .pupd = 1, .speed = 3, .af = 0
//    };
//    reg =  ipgui_readl(RCC_AHB1ENR_ADDR);
//    reg |= (1 << 1);
//    ipgui_writel(RCC_AHB1ENR_ADDR, reg);

//    PIN_INIT(STM32_GPIO_PORT_B, STM32_GPIO_PIN_5);

//    reg =  ipgui_readl(GPIOR(dsc.port, 5));             /* read and set odr register */
//    reg |= (1 << dsc.pin);
//    ipgui_writel(GPIOR(dsc.port, 5), reg);
//    /* user code end here */
}

static void turn_off_lcd_backlight(void)
{
    /* user code begin here */
    int reg;
    stm32_gpio_dsc_t dsc;
    dsc.port = STM32_GPIO_PORT_B; dsc.pin = STM32_GPIO_PIN_1;
    reg =  ipgui_readl(GPIOR(dsc.port, 5));             /* read and reset odr register */
    reg &= ~(1 << dsc.pin);
    ipgui_writel(GPIOR(dsc.port, 5), reg);
    /* user code end here */
}
//360 2 1----45M  //200 2 1----25M
int ltdc_clk_init(int pllsain, int pllsair, int pllsaidivr)
{ 
	int retry = 0;
	int status = 0;
	int tempreg = 0;
	RCC->CR &= ~(1 << 28);
	while (((RCC->CR & (1 << 29))) && (retry < 0x1fff)) retry ++;
 	if (retry == 0x1fff) status=1;
	else
	{
		tempreg |= pllsain << 6;
		tempreg |= pllsair << 28;
		RCC->PLLSAICFGR = tempreg;
		RCC->DCKCFGR &= ~(3 << 16);
		RCC->DCKCFGR |= pllsaidivr << 16;

		RCC->CR |= 1 << 28;
        retry = 0;
		while (((RCC->CR & (1 << 29)) == 0) && (retry < 0x1fff)) retry ++;
		if (retry == 0x1fff) status=2;
 	}
	return status;
}

/* define IRQ channel */
#define STM32F4_IRQ_LTDC        88                      /* fixed, don't change */
#define STM32F4_IRQ_LTDC_ERR    89                      /* fixed, don't change */

/* define ltdc interrupt masks */
#define LINE_MASK               1U                      /* fixed, don't change */
#define FIFO_UNDERRUN_MASK      2U                      /* fixed, don't change */
#define TRANSFER_ERR_MASK       4U                      /* fixed, don't change */
#define REG_RELOAD_MASK         8U                      /* fixed, don't change */

static void ltdc_irq_init(void)
{
    /* user code begin here */
    ipgui_writel(LTDC_IER_ADDR, LINE_MASK);             /* enable ltdc irq */
    /* user code end here */

    ipgui_NVIC_irq_prio_set(STM32F4_IRQ_LTDC, 255);
    ipgui_NVIC_enable_irq(STM32F4_IRQ_LTDC);
}
#include "lv_hal_disp.h"
extern lv_disp_drv_t disp_drv; 
/* irq callback function */
/* 在中断中，LCD控制器不会停止运行，仍然继续读framebuffer并显示 */
void LTDC_IRQHandler(void)
{
    int irq_status = ipgui_readl(LTDC_ISR_ADDR);
    /* check which irq is active */
    if (irq_status & 0x01) {                            /* line interrupt */
        /* 通过示波器测量LED翻转次数，来计算每秒进了几次中断，测量后每秒大约进入了52.63次中断
         * 而LCD物理帧数是45Mhz/853440 ≈ 52.72fps，跟测量值吻合
         * 853440（个pixel clock） = (vsh + vbp + ah + vfp) * (hsw + hbp + aw + hfp)
         * 此中断是在VSYNC的第一行触发（因为中断行位置寄存器被设置为0）
         * 比Reload中断（VFP触发）晚（aw + hsw + hbp + aw + hfp）* vfp * （1/45Mhz）约360us，已通过示波器观察验证
         */
        if (back_state == 1) {/* lvgl ready */
            if(!dma_busy) {
                dma_busy = 1;
                LTDC_Color_Fill(x1, y1, x2, y2, color);
            }
            //    // LED1 = !LED1;
            // ltdc_layer1_reload_framebuffer_imediately((void *)back_lcd_framebuffer);
            // /* 交换前后framebuffer */
            // {
            //     unsigned short * temp;
            //     temp = fore_lcd_framebuffer;
            //     fore_lcd_framebuffer = back_lcd_framebuffer;
            //     back_lcd_framebuffer = temp;
            // }
            // back_state = 0;
            // lv_disp_flush_ready(&disp_drv);
        }
        if (back_render_ready == 1) {
            ltdc_layer1_reload_framebuffer_imediately((void *)back_lcd_framebuffer);
            /* 交换前后framebuffer */
            unsigned short * temp;
            temp = fore_lcd_framebuffer;
            fore_lcd_framebuffer = back_lcd_framebuffer;
            back_lcd_framebuffer = temp;
            back_state = 0;
            back_render_ready = 0;
                dma_busy = 0;
            lv_disp_flush_ready(&disp_drv);
        }
    }
    if (irq_status & 0x02) {                            /* fifo underrun interrupt */
        
