jinyichengX/test/ESDBox_IPGUI/scr_driver/stm32/stm32f4/stm32f429_39xx.c
    }
    if (irq_status & 0x04) {                            /* transform error interrupt */
        
    }
    if (irq_status & 0x08) {                            /* register reload interrupt */
        /* 实验现象表明此中断比行中断（行设置为0，VSYNC时触发）早（aw + hsw + hbp + aw + hfp）* vfp * （1/45Mhz）约360us */
        // LED0 = !LED0;        
    }
    ipgui_writel(LTDC_ICR_ADDR, irq_status);            /* clear irq status */
}

void stm32_ltdc_ll_init(unsigned int pix_clk, lcd_panel_param_t * pp, void * fb)
{																																										
    int reg = 0, reg1 = 0;
    stm32_gpio_dsc_t dsc;
    stm32_gpio_ctl_t ctl;
    ctl.mode = 2;
    ctl.otype = 0;
    ctl.pupd = 1;
    ctl.speed = 3;
    ctl.af = 14;
    /* configure sys clk */                     
	if(pix_clk == 25) ltdc_clk_init(200, 2, 1);/* 设置像素时钟25Mhz */
    else if(pix_clk == 45) ltdc_clk_init(360, 2, 1);                           /* 设置像素时钟45Mhz */
    /* configure lcd gpio */
    /* 下面的引脚对应关系不是唯一的，下面只列出了STM32F429IGT6的（部分）引脚，对于不同的硬件需要修改引脚 */
    /* R0-PH2   G0-PE5   B0-PE4  */         /* DE-PF10 */
    /* R1-PH3   G1-PE6   B1-PG12 */         /* CLK-PG7 */
    /* R2-PH8   G2-PH13  B2-PG10  */        /* VSYNC-PI9 */    
    /* R3-PH9   G3-PH14  B3-PG11 */         /* HSYNC-PI10  */
    /* R4-PH10  G4-PH15  B4-PI4  */
    /* R5-PH11  G5-PI0   B5-PI5  */
    /* R6-PH12  G6-PI1   B6-PI6  */
    /* R7-PG6   G7-PI2   B7-PI7  */
    reg =  ipgui_readl(RCC_AHB1ENR_ADDR);               /* enable gpioE/F/G/H/I clock first */
    reg |= 0x1f0U;
    ipgui_writel(RCC_AHB1ENR_ADDR, reg);

    if ((pp->bpp == 24) || (pp->bpp == 32)) {
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_2 );     /* configure LCD R0 - R7 */
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_3 );
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_8 );
    }
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_9 );
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_10);
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_11);
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_12);
    PIN_INIT(STM32_GPIO_PORT_G, STM32_GPIO_PIN_6 );

    if ((pp->bpp == 24) || (pp->bpp == 32)) {
    PIN_INIT(STM32_GPIO_PORT_E, STM32_GPIO_PIN_5 );     /* configure LCD G0 - G7 */
    PIN_INIT(STM32_GPIO_PORT_E, STM32_GPIO_PIN_6 );
    }
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_13);
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_14);
    PIN_INIT(STM32_GPIO_PORT_H, STM32_GPIO_PIN_15);
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_0 );
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_1 );
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_2 );

    if ((pp->bpp == 24) || (pp->bpp == 32)) {
    PIN_INIT(STM32_GPIO_PORT_E, STM32_GPIO_PIN_4 );     /* configure LCD B0 - B7 */
    PIN_INIT(STM32_GPIO_PORT_G, STM32_GPIO_PIN_12);
    PIN_INIT(STM32_GPIO_PORT_G, STM32_GPIO_PIN_10);
    }
    PIN_INIT(STM32_GPIO_PORT_G, STM32_GPIO_PIN_11);
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_4 );
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_5 );
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_6 );
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_7 );

    PIN_INIT(STM32_GPIO_PORT_F, STM32_GPIO_PIN_10);     /* configure LCD DE */
    PIN_INIT(STM32_GPIO_PORT_G, STM32_GPIO_PIN_7 );     /* configure LCD CLK */
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_9 );     /* configure LCD VSYNC */
    PIN_INIT(STM32_GPIO_PORT_I, STM32_GPIO_PIN_10);     /* configure LCD HSYNC */

    /* configure lcd clock */
    reg =  ipgui_readl(RCC_APB2ENR_ADDR);
    reg |= 1 << 26;
    ipgui_writel(RCC_APB2ENR_ADDR, reg);                /* enable ltdc clock */

    /* configure synchronous signals and clock polarity  */
	reg =  0 << 28;                                     /* Pixel Clock Polarity */
	reg |= 0 << 29;                                     /* Data Enable polarity is active low */
	reg |= 0 << 30;                                     /* Vertical synchronization polarity is active low */
	reg |= 0 << 31;                                     /* Horizontal synchronization polarity is active low */
    ipgui_writel(LTDC_GCR_ADDR, reg);

    /* configure synchronous timings */
    reg =  pp->vsh - 1;
    reg |= (pp->hsw - 1) << 16;
    ipgui_writel(LTDC_SSCR_ADDR, reg);

    reg =  pp->vsh + pp->vbp - 1;
    reg |= (pp->hsw + pp->hbp - 1) << 16;
    ipgui_writel(LTDC_BPCR_ADDR, reg);

    reg =  pp->vsh + pp->vbp + pp->ah - 1;
    reg |= (pp->hsw + pp->hbp + pp->aw - 1) << 16;
    ipgui_writel(LTDC_AWCR_ADDR, reg);

    reg =  pp->vsh + pp->vbp + pp->ah + pp->vfp - 1;
    reg |= (pp->hsw + pp->hbp + pp->aw + pp->hfp - 1) << 16;
    ipgui_writel(LTDC_TWCR_ADDR, reg);

    /* set background color if needed */
    stm32_ltdc_set_bk(0xffffffff);

    /* configure layer1 and layer2, if two layers are enabled, 
     * the layer2 is the top displayed window, we only need to set layer1
     */
    reg =  ipgui_readl(LTDC_BPCR_ADDR);                 /* set layer1 window size */
    reg1=  ipgui_readl(LTDC_AWCR_ADDR);
    reg =  (((reg & 0x0fff0000U) >> 16) + 1);
    reg |= (reg1 & 0x0fff0000U);
    ipgui_writel(LTDC_LWHPCR_ADDR(1), reg);

    reg = ipgui_readl(LTDC_BPCR_ADDR);
    reg1= ipgui_readl(LTDC_AWCR_ADDR);
    reg = (reg & 0x7ffU) + 1;
    reg |= ((reg1 & 0x7ffU) << 16);
    ipgui_writel(LTDC_LWVPCR_ADDR(1), reg);

    ipgui_writel(LTDC_LCACR_ADDR(1), 255U);             /* set layer1 alpha 255, it means background color is all covered, we don't need backgroud, everything will be controled by software or GUI framework!! */

    ipgui_writel(LTDC_LDCCR_ADDR(1), 0x0U);             /* don't need default color, this is a dog's shit register */

    ipgui_writel(LTDC_LBFCR_ADDR(1), 0x00000607U);      /* don't need hardware blending color, set defualt*/

	if (pp->bpp == 32) {
		reg = 0;
	} else if(pp->bpp == 24) {                          /* set layer1 pixel format */
        reg = 1;
    } else if (pp->bpp == 16) {
		reg = 2;
	}
    ipgui_writel(LTDC_LPFCR_ADDR(1), reg);

    ipgui_writel(LTDC_LCFBAR_ADDR(1), (int)fb);         /* set framebuffer addr */

    reg = (pp->bpp / 8) * pp->aw;
    reg = (reg << 16) | (reg + 3);
    ipgui_writel(LTDC_LCFBLR_ADDR(1), reg);             /* set bytes per line */

    ipgui_writel(LTDC_LCFBLNR_ADDR(1), pp->ah);         /* set color framebuffer line number, corresponding to active height */

