jinyichengX/test/ESDBox_IPGUI/scr_driver/stm32/stm32f4/stm32f429_39xx.c
    ipgui_writel(LTDC_LCR_ADDR(1), 0x1U);               /* enable layer1 */

    reg = ipgui_readl(LTDC_SRCR_ADDR);
    reg |= 1U << 0;
    ipgui_writel(LTDC_SRCR_ADDR, reg);                  /* reload layer1/2 immediately, must do it! */

    /* configure interruptes if needed */
    ltdc_irq_init();

    /* enable ltdc */
    reg = ipgui_readl(LTDC_GCR_ADDR);
    reg |= 1 << 0;
    ipgui_writel(LTDC_GCR_ADDR, reg);

    /* turn on LCD backlight if needed  */
    turn_on_lcd_backlight();
	
	fore_lcd_framebuffer = ltdc_lcd_framebuf1;
    back_lcd_framebuffer = ltdc_lcd_framebuf;
    back_state = 0;
	
	__HAL_RCC_DMA2D_CLK_ENABLE();	//使能DM2D时钟
	dma2d_irq_init();
}

#define STM32_DMA2D_IRQn 90
void dma2d_irq_init(void)
{
	/* enable ltdc irq */
    ipgui_NVIC_irq_prio_set(STM32_DMA2D_IRQn, 5);
    ipgui_NVIC_enable_irq(STM32_DMA2D_IRQn);
}

/* reload layer1 framebuffer address imediately */
void ltdc_layer1_reload_framebuffer_imediately(void * fb)
{
    ipgui_writel(LTDC_LCFBAR_ADDR(1), (int)fb);         /* set framebuffer addr */
    ipgui_writel(LTDC_SRCR_ADDR, 0x1U);                 /* reload layer1 */
}
 
/* 在垂直消隐区的第一行更改framebuffer，也就是VFP的第一行
 * 如果调用了这个函数，且又开启了reload中断，那么到下一个垂直消隐区的第一行（VFP）时就会触发中断
 * 每次调用只触发一次Reload中断（如果Reload中断开启）
 * 如果调用了此函数后再且在reload中断触发前又调用了ltdc_layer1_reload_framebuffer_imediately，那么reload中断不会响应
 */
/* reload layer1 framebuffer address at first line of vertical blanking */
void ltdc_layer1_reload_framebuffer_blanking(void * fb)
{
    ipgui_writel(LTDC_LCFBAR_ADDR(1), (int)fb);         /* set framebuffer addr */
    ipgui_writel(LTDC_SRCR_ADDR, 0x2U);                 /* reload layer1 later */
}

/* 在读指针（硬件自动）写指针（程序写framebuffer）同时对同一个物理内存SDRAM framebuffer操作时，会导致屏幕出现大片雪花，应避免这个问题 */

/* 下面是bpp为32和24时写framebuffer的例子 */
void sw_fill_pixel(int x, int y, unsigned int color)//这里传入的color带Alpha通道
{
//	    /* 舍弃color中的A */    //写法2
//    ltdc_lcd_framebuf[LCD_WIDTH*y+x] = color | 0xff000000;
	ltdc_lcd_framebuf[LCD_WIDTH*y+x] = (unsigned short)color;
#if 0
    //32bit

    /* 舍弃color中的A */    //写法1
	*(u8*)(ltdc_framebuf[0]+4*(1024*y+x)) = color & 0xff;//B
	*(u8*)(ltdc_framebuf[0]+4*(1024*y+x)+1) = (color & 0xff00) >> 8;//G
	*(u8*)(ltdc_framebuf[0]+4*(1024*y+x)+2) = (color & 0xff0000) >> 16;//R
	*(u8*)(ltdc_framebuf[0]+4*(1024*y+x)+3) = 200;/* A分量会与上面的RGB相乘 */
    /* 舍弃color中的A */    //写法2
    *(u32*)(ltdc_framebuf[0]+4*(1024*y+x)) = color | 0xff000000;

    /* 保留color中的A */    //写法
    *(u32*)(ltdc_framebuf[0]+4*(1024*y+x)) = color;

    //24bit
    *(u8*)(ltdc_framebuf[0]+3*(1024*y+x)) = color & 0xff;//B
	*(u8*)(ltdc_framebuf[0]+3*(1024*y+x)+1) = (color & 0xff00) >> 8;//G
	*(u8*)(ltdc_framebuf[0]+3*(1024*y+x)+2) = (color & 0xff0000) >> 16;//R
#endif
}

void LCD_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u32 color)
{ 
//	u32 psx,psy,pex,pey;	//以LCD面板为基准的坐标系,不随横竖屏变化而变化
//	u32 timeout=0; 
//	u16 offline;
//	u32 addr; 
//	//坐标系转换
//	if(1)	//横屏
//	{
//		psx=sx;psy=sy;
//		pex=ex;pey=ey;
//	}
//	offline=LCD_WIDTH-(pex-psx+1);
//	addr=((u32)ltdc_lcd_framebuf+4*(LCD_WIDTH*psy+psx));
//	__HAL_RCC_DMA2D_CLK_ENABLE();//使能DM2D时钟
//	DMA2D->CR&=~(DMA2D_CR_START);	//先停止DMA2D
//	DMA2D->CR=((uint32_t)0x00030000);			//寄存器到存储器模式
//	DMA2D->OPFCCR=0;	//设置颜色格式ARGB8888
//	DMA2D->OOR=offline;				//设置行偏移 

//	DMA2D->OMAR=addr;				//输出存储器地址
//	DMA2D->NLR=(pey-psy+1)|((pex-psx+1)<<16);	//设定行数寄存器
//	DMA2D->OCOLR=color | 0xff000000;						//设定输出颜色寄存器 
//	DMA2D->CR|=DMA2D_CR_START;				//启动DMA2D
//	while((DMA2D->ISR&(((uint32_t)0x00000002)))==0)	//等待传输完成
//	{
//		timeout++;
//		if(timeout>0X1FFFFF)break;	//超时退出
//	} 
//	DMA2D->IFCR|=((uint32_t)0x00000002);		//清除传输完成标志 		
    for (int x = sx; x < ex; x++)
    {
        for (int y = sy; y < ey; y++)
        {
            sw_fill_pixel(x, y, color);
        }
    }
}

void DMA2D_IRQHandler(void)
{
    int isr = DMA2D->ISR;

    if (isr & DMA2D_ISR_TCIF)   /* transfer complete interrupt */
    {
        DMA2D->CR &= ~DMA2D_CR_TCIE;        //传输完成中断失能
        DMA2D->IFCR |= ((uint32_t)DMA2D_ISR_TCIF);				//清除传输完成中断标志  	

        back_render_ready = 1;
    }

}

void LTDC_Color_Fill(u16 sx, u16 sy, u16 ex, u16 ey, u16 *color)
{
	u32 psx, psy, pex, pey;	//以LCD面板为基准的坐标系,不随横竖屏变化而变化
	u16 offline;
	u32 addr; 

	psx = sx; psy = sy;
	pex = ex; pey = ey;

	offline = LCD_WIDTH - (pex - psx + 1);
	addr = (u32)(((u32)back_lcd_framebuffer) + 2 * (LCD_WIDTH * psy + psx));

	DMA2D->CR &= ~(DMA2D_CR_START);	//先停止DMA2D
	DMA2D->CR = ((uint32_t)0x00000000);			//存储器到存储器模式
	DMA2D->FGPFCCR = 0X02;	//设置颜色格式
	DMA2D->FGOR = 0;					//前景层行偏移为0
	DMA2D->OOR = offline;				//设置行偏移 

	DMA2D->FGMAR = (u32)color;		//源地址
	DMA2D->OMAR = addr;				//输出存储器地址
	DMA2D->NLR = (pey - psy + 1) | ((pex - psx + 1) << 16);	//设定行数寄存器 

    DMA2D->CR |= DMA2D_CR_TCIE;    //传输完成中断使能
	DMA2D->CR |= DMA2D_CR_START;					//启动DMA2D
    // u32 timeout = 0; 
	// while((DMA2D->ISR&(((uint32_t)0x00000002)))==0)		//等待传输完成
	// {
	// 	timeout++;
	// 	if(timeout>0X1FFFFF)break;	//超时退出
	// } 
	// DMA2D->IFCR|=((uint32_t)0x00000002);				//清除传输完成标志  	
}  

void LTDC_Color_Fill1(u16 sx,u16 sy,u16 ex,u16 ey,u16 *color)
{
	u32 psx,psy,pex,pey;	//以LCD面板为基准的坐标系,不随横竖屏变化而变化

	u16 offline;
	u32 addr; 
	//坐标系转换
	//横屏

	psx=sx;psy=sy;
	pex=ex;pey=ey;

	offline=LCD_WIDTH-(pex-psx+1);
	addr=(u32)(((u32)fore_lcd_framebuffer)+2*(LCD_WIDTH*psy+psx));

	DMA2D->CR&=~(DMA2D_CR_START);	//先停止DMA2D
	DMA2D->CR=((uint32_t)0x00000000);			//存储器到存储器模式
	DMA2D->FGPFCCR=0X02;	//设置颜色格式
	DMA2D->FGOR=0;					//前景层行偏移为0
	DMA2D->OOR=offline;				//设置行偏移 

	DMA2D->FGMAR=(u32)color;		//源地址
	DMA2D->OMAR=addr;				//输出存储器地址
	DMA2D->NLR=(pey-psy+1)|((pex-psx+1) << 16);	//设定行数寄存器 

    DMA2D->CR |= DMA2D_CR_TCIE;    //开启传输完成中断
	DMA2D->CR |= DMA2D_CR_START;					//启动DMA2D
    	// u32 timeout=0; 
	// while((DMA2D->ISR&(((uint32_t)0x00000002)))==0)		//等待传输完成
	// {
	// 	timeout++;
	// 	if(timeout>0X1FFFFF)break;	//超时退出
	// } 
	// DMA2D->IFCR|=((uint32_t)0x00000002);				//清除传输完成标志  	
}  